{"url": "https://www.wikipedia.org", "text": "Wikipedia Wikipedia The Free Encyclopedia Wikipedia 25 years of the free encyclopedia Who is hiding in the globe? A special new friend is waiting inside the puzzle globe. Uncover who it is and learn what other surprises are in store for Wikipedia's 25th birthday. A special new friend is waiting inside the puzzle globe. Uncover who it is and learn what other surprises are in store for Wikipedia's 25th birthday. Search Wikipedia en Afrikaans Shqip العربية Asturianu Azərbaycanca Български 閩南語 / Bân-lâm-gú বাংলা Беларуская Català Čeština Cymraeg Dansk Deutsch Eesti Ελληνικά English Español Esperanto Euskara فارسی Français Galego 한국어 Հայերեն हिन्दी Hrvatski Bahasa Indonesia Italiano עברית ქართული Ladin Latina Latviešu Lietuvių Magyar Македонски Malagasy मराठी مصرى Bahasa Melayu Bahaso Minangkabau မြန်မာဘာသာ Nederlands 日本語 Norsk (bokmål) Norsk (nynorsk) Нохчийн Oʻzbekcha / Ўзбекча Polski Português Қазақша / Qazaqşa / قازاقشا Română Simple English Sinugboanong Binisaya Slovenčina Slovenščina Српски / Srpski Srpskohrvatski / Српскохрватски Suomi Svenska Kiswahili தமிழ் Татарча / Tatarça తెలుగు ภาษาไทย Тоҷикӣ تۆرکجه Türkçe Українська اردو Tiếng Việt Winaray 中文 Русский 粵語 Search Donate now | I already donated We owe you an explanation. An important update for readers in the United States . Please don't skip this 1-minute read. This fundraiser will soon be over, but we haven't yet hit our goal. If you're like us, you've used Wikipedia countless times. To settle an argument with a friend. To satisfy a curiosity. Whether it's 3 in the morning or afternoon, Wikipedia is useful in your life. Please give $2.75 . After nearly 25 years, Wikipedia is still the internet we were promised—created by people, not by machines. It's not perfect, but it's not here to push a point of view. It's owned by a nonprofit, not a giant technology company or a billionaire. Just 2% of our readers donate, so if you have given in the past and Wikipedia still provides you with $2.75 worth of knowledge, donate today. If you are undecided, remember any contribution helps. Please select an amount ( $ ) . The average donation in the United States is around $13 . Many first-time donors give $2.75 . All that matters is that you're choosing to stand up for free, open information; and for that, you have our gratitude. $2.75 $ 5 $ 10 $ 20 $ 30 $ 50 $ 100 Other How often would you like to donate? One time Give monthly Donate now We ask you, sincerely: don't skip this, join the 2% of readers who give. 25 years of the internet at its best Collapse Sorry to interrupt, but we're short on time to hit our goal. Today, we ask you to join the 2% of readers who give. If everyone reading this right now gave just $2.75 , we'd hit our goal quickly. $2.75 is all we ask. — The Wikimedia Foundation, host of Wikipedia and other free knowledge projects . Donate now 🎉 Thank you for donating recently! 🎉 Your support means the world to us. We'll hide banners in this browser for the rest of our campaign. Want to show off your support? Donors get 20% off Wikipedia Store merchandise automatically applied at checkout. Click the button below to shop hats, tees, and more! Go to the Wikipedia Store Close", "timestamp": 1769527053.9293575}